{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_col": 3, "b_constraint": null, "trainable": true, "nb_filter": 32, "batch_input_shape": [null, 64, 64, 3], "dim_ordering": "tf", "nb_row": 3, "activation": "linear", "name": "convolution2d_1", "input_dtype": "float32", "b_regularizer": null, "init": "glorot_uniform", "border_mode": "valid", "subsample": [1, 1], "W_constraint": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "pool_size": [2, 2], "trainable": true, "border_mode": "valid", "strides": [2, 2], "dim_ordering": "th"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "b_constraint": null, "trainable": true, "init": "glorot_uniform", "name": "convolution2d_2", "dim_ordering": "th", "nb_row": 3, "activation": "linear", "b_regularizer": null, "nb_filter": 64, "border_mode": "valid", "subsample": [1, 1], "W_constraint": null, "nb_col": 3, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_2", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "pool_size": [2, 2], "trainable": true, "border_mode": "valid", "strides": [2, 2], "dim_ordering": "th"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "name": "dense_1", "input_dim": null, "W_regularizer": null, "b_regularizer": null, "output_dim": 128, "init": "glorot_uniform", "W_constraint": null, "trainable": true, "activity_regularizer": null, "b_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "name": "dense_2", "input_dim": null, "W_regularizer": null, "b_regularizer": null, "output_dim": 48, "init": "glorot_uniform", "W_constraint": null, "trainable": true, "activity_regularizer": null, "b_constraint": null}}, {"class_name": "Activation", "config": {"activation": "sigmoid", "name": "activation_3", "trainable": true}}]}